cbernett/pipas/nrf/nRF5_SDK_11.0.0_89a8197/applications/code/pipas/include/nrf_bno055.c

//#include <stdatomic.h>
#include <stdint.h>

#include "nrf_bno055.h"

#include "nrf_assert.h"
#include "nrf_error.h"

#include "app_timer.h"
#include "nrf_drv_twi.h"
#include "nrf_evt_queue.h"

#include "fes_imu_core.h"

/* The maximum time the BNO055 is allowed to stretch the clock */
#define BNO055_TWI_TIMEOUT_TIME_MS 500

/* Minimum time the I2C bus must remain idle between writes when on suspend mode low or power mode. 
 * Taken from table 4-8 of the datasheet */
#define BNO055_LONG_WRITE_IDLE_TIME_US 500

typedef enum {
    BNO055_PAGE_0 = 0x00,
    BNO055_PAGE_1 = 0x01,
    BNO055_PAGE_INVALID
} bno055_page_t;

typedef enum {
    REGISTER_OPERATION_TYPE_READ,
    REGISTER_OPERATION_TYPE_WRITE
} register_operation_type_t;

typedef struct {
    register_operation_type_t type;
    uint8_t address;
    union {
        struct {
            uint8_t   rx_len;
            uint8_t * p_rx_buf;
        } read;
        uint8_t write;
    } data;
} register_operation_t;

static void (*bno055_evt_callback)(bno055_evt_t *);

static bno055_failure_reason_t failure_reason = BNO055_FAILURE_REASON_NONE;

/************************/
/* Forward declarations */
/************************/

static void on_register_operation_success(const register_operation_t *);
static void on_failure(bno055_failure_reason_t);
static void remote_state_update(void);

/********************/
/* Helper functions */
/********************/

/**
 * @brief Returns whether a given mode is a fusion mode.
 * 
 * @details Refer to the section 3.3.3 of revision 1.4 of the BNO055 datasheet for a list of fusion
 *          modes.
 */
static bool is_fusion_mode(bno055_operating_mode_t operating_mode)
{
    bool b_is_fusion_mode;
    switch (operating_mode)
    {
        case BNO055_OPERATING_MODE_IMU:
        case BNO055_OPERATING_MODE_COMPASS:
        case BNO055_OPERATING_MODE_M4G:
        case BNO055_OPERATING_MODE_NDOF_FMC_OFF:
        case BNO055_OPERATING_MODE_NDOF:
            b_is_fusion_mode = true;
        break;
        default:
            b_is_fusion_mode = false;
        break;
    }
    return b_is_fusion_mode;
}

static uint32_t get_operating_mode_transition_time_ms(bno055_operating_mode_t start_mode,
    bno055_operating_mode_t end_mode)
{
    uint32_t transition_time_ms;

    if (start_mode == end_mode)
    {
        transition_time_ms = 0;
    }
    else if (BNO055_OPERATING_MODE_CONFIGMODE == start_mode
          && BNO055_OPERATING_MODE_CONFIGMODE != end_mode)
    {     
        transition_time_ms = BNO055_CONFIGMODE_TO_ANY_TIME_MS;
    }
    else if (BNO055_OPERATING_MODE_CONFIGMODE != start_mode
          && BNO055_OPERATING_MODE_CONFIGMODE == end_mode)
    {
        transition_time_ms = BNO055_ANY_TO_CONFIGMODE_TIME_MS;
    }
    else /* From not CONFIGMODE to not CONFIGMODE */
    {
        // TODO
        ASSERT(false);
    }

    return transition_time_ms;
}

static uint32_t get_power_mode_transition_time_ms(bno055_power_mode_t start_mode,
    bno055_power_mode_t end_mode)
{
    uint32_t transition_time_ms = 0;
    if (BNO055_POWER_MODE_SUSPEND == start_mode && BNO055_POWER_MODE_NORMAL == end_mode)
    {
        transition_time_ms = 750;
    }

    return transition_time_ms;
}

/**
 * @brief Whether an operation will alter the state of the IMU
 * 
 * Operating mode, power mode and register page are considered part of the IMU state.
 */
static bool alters_state(const register_operation_t * p_op)
{
    return REGISTER_OPERATION_TYPE_WRITE == p_op->type
        && (BNO055_REG_ADDR_OPR_MODE == p_op->address
        ||  BNO055_REG_ADDR_PWR_MODE == p_op->address
        ||  BNO055_REG_ADDR_PAGE_ID  == p_op->address);
}

/********************************************/
/** I2C to register write/reads abstraction */
/********************************************/

nrf_drv_twi_t twi_instance = NRF_DRV_TWI_INSTANCE(0);

APP_TIMER_DEF(write_idle_time_done_timer);
static nrf_evt_queue_evt_t write_idle_time_done_evt;
static bool b_on_write_idle_time = false;

APP_TIMER_DEF(register_timeout_timer);
static nrf_evt_queue_evt_t register_timeout_evt; 

/* Buffers for TX and RX I2C data.
 * TODO: I am not sure whether the nrf_drv_twi requires them to be statically allocated or not, so
 *       I'm leaving it statically allocated for now. */
#define REGISTER_TX_BUFFER_SIZE 2 
#define REGISTER_RX_BUFFER_SIZE 8
static uint8_t register_tx_buffer[REGISTER_TX_BUFFER_SIZE];
static uint8_t register_rx_buffer[REGISTER_RX_BUFFER_SIZE];

/* Information on the last operation performed */
static register_operation_t register_last_op;

typedef enum {
    /* Available to perform a new operation */
    REGISTER_OPERATION_STATE_AVAILABLE,
    /* Waiting for the required idle time to pass (specified on table 4-8 of the datasheet) */
    REGISTER_OPERATION_STATE_IDLE_TIME,
    /* Ongoing TWI operation */
    REGISTER_OPERATION_STATE_ONGOING
} register_operation_state_t;

/* Whether there is currently an ongoing read or write operation. */
static bool register_operation_ongoing = false;

static nrf_evt_queue_evt_t register_operation_done_evt;
/* For passing TWI event information from the interrupt handler to main context */
static nrf_drv_twi_evt_t   register_operation_twi_evt_result;

static void write_idle_time_done_evt_callback(void)
{
    b_on_write_idle_time = false;
    remote_state_update();
}

static void write_idle_time_done_handler(void * p_context)
{
    uint32_t err_code = nrf_evt_queue_put(&write_idle_time_done_evt, write_idle_time_done_evt_callback);
    APP_ERROR_CHECK(err_code);
}

static void register_timeout_evt_handler(void)
{
    bool b_timed_out;
    
    CRITICAL_REGION_ENTER();
    /* Because the TWI interrupt cancels the timeout timer and event, if the TWI interrupt actually
     * happened, it must have queued its event *after* the timeout event.
     * This is a situation where it matters that event queues are ordered */
    b_timed_out = !nrf_evt_queue_is_queued(&register_operation_done_evt);
    if (b_timed_out) nrf_drv_twi_disable(&twi_instance);
    CRITICAL_REGION_EXIT();

    if (b_timed_out)
    {
        on_failure(BNO055_FAILURE_REASON_TWI_TIMEOUT);
    }
}

static void register_timeout_handler(void * p_context)
{
    uint32_t err_code = nrf_evt_queue_put(&register_timeout_evt, register_timeout_evt_handler);
    APP_ERROR_CHECK(err_code);
}

static void register_twi_evt_callback(void)
{
    register_operation_ongoing = false;

    switch (register_operation_twi_evt_result.type)
    {
        /* On success, update the remote state */
        case NRF_DRV_TWI_EVT_DONE:
        {
            register_operation_t operation;
            const nrf_drv_twi_xfer_desc_t * const p_xfer_desc = &register_operation_twi_evt_result.xfer_desc;
            switch (register_operation_twi_evt_result.xfer_desc.type)
            {
                case NRF_DRV_TWI_XFER_TX: /* Register write */
                    ASSERT(NULL != p_xfer_desc->p_primary_buf && 2 == p_xfer_desc->primary_length);
                    operation.type = REGISTER_OPERATION_TYPE_WRITE;
                    operation.address = p_xfer_desc->p_primary_buf[0];
                    operation.data.write = p_xfer_desc->p_primary_buf[1];

                    /* Indiscriminately wait the 500 us before allowing the next write.
                     * We do this because, even though the datasheet says we only need to wait 2 us
                     * when on normal mode, it doesn't specify which time applies when moving from
                     * suspend mode to normal mode or vice-versa.
                     * It's just easier to do a blanket 500 us and not worry about figuring out a
                     * low quality datasheet.
                     */
                    b_on_write_idle_time = true;
                    uint32_t write_idle_time_done_ticks = (uint32_t) CEIL_DIV(BNO055_LONG_WRITE_IDLE_TIME_US
                        * (uint64_t) APP_TIMER_CLOCK_FREQ, (APP_TIMER_PRESCALER + 1) * (uint64_t) 1000000);
                    uint32_t err_code = app_timer_start(write_idle_time_done_timer, write_idle_time_done_ticks, NULL);
                    APP_ERROR_CHECK(err_code);
                break;
                case NRF_DRV_TWI_XFER_TXRX: /* Register read */
                    ASSERT(NULL != p_xfer_desc->p_primary_buf && 1 == p_xfer_desc->primary_length);
                    ASSERT(NULL != p_xfer_desc->p_secondary_buf);
                    operation.type = REGISTER_OPERATION_TYPE_READ;
                    operation.address = p_xfer_desc->p_primary_buf[0];
                    operation.data.read.p_rx_buf = p_xfer_desc->p_secondary_buf;
                    operation.data.read.rx_len = p_xfer_desc->secondary_length;
                break;
                default:
                    ASSERT(false);
                break;
            }
            on_register_operation_success(&operation);
        } break;
        /* On failure, disable TWI and report the failure */
        case NRF_DRV_TWI_EVT_ADDRESS_NACK:
        case NRF_DRV_TWI_EVT_DATA_NACK:
            nrf_drv_twi_disable(&twi_instance);
            on_failure(BNO055_FAILURE_REASON_TWI_ACK);
        break;
        default:
            ASSERT(false);
        break;
    }
}

/**
 * @brief Handler for TWI events reported by the nrf_drv_twi module.
 * 
 * @warning Called from inside a TWI interrupt.
 */
static void register_twi_handler(const nrf_drv_twi_evt_t * p_evt, void * p_context)
{
    (void) app_timer_stop(register_timeout_timer);
    (void) nrf_evt_queue_remove(&register_timeout_evt);

    register_operation_twi_evt_result = *p_evt;
    uint32_t err_code = nrf_evt_queue_put(&register_operation_done_evt, register_twi_evt_callback);
    // TODO: APP_ERROR_CHECKs won't work with the current interrupt priority, the
    // app_error_fault_handler needs to be fixed. We'll leave it anyway.
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief   Write to BNO055 register.
 * 
 * @details After the write is complete, the callback is called in main context using nrf_evt_queue.
 * 
 * @retval  NRF_SUCCESS    Successfully started write
 * @retval  NRF_ERROR_BUSY There is a read/write operation already ongoing
 */
static uint32_t register_read(bno055_reg_addr_t reg_address, uint8_t length)
{
    uint32_t ret_code;
    if (register_operation_ongoing)
    {
        ret_code = NRF_ERROR_BUSY;
    }
    else
    {
        ASSERT(length <= REGISTER_RX_BUFFER_SIZE);

