cbernett/pipas/nrf/nRF5_SDK_11.0.0_89a8197/applications/code/pipas/include/nrf_bno055.c
        register_last_op.type = REGISTER_OPERATION_TYPE_READ;
        register_last_op.address = reg_address;
        register_last_op.data.read.p_rx_buf = register_rx_buffer;
        register_last_op.data.read.rx_len = length;

        nrf_drv_twi_xfer_desc_t xfer_desc = {
            .type = NRF_DRV_TWI_XFER_TXRX,
            .address = BNO055_ADDRESS_1,
            .primary_length = 1,
            .secondary_length = length,
            .p_primary_buf = register_tx_buffer,
            .p_secondary_buf = register_rx_buffer
        };

        register_tx_buffer[0] = reg_address;

        uint32_t err_code = nrf_drv_twi_xfer(&twi_instance, &xfer_desc, 0);
        APP_ERROR_CHECK(err_code);
        err_code = app_timer_start(register_timeout_timer, APP_TIMER_TICKS(BNO055_TWI_TIMEOUT_TIME_MS,
            APP_TIMER_PRESCALER), NULL);
        APP_ERROR_CHECK(err_code);

        register_operation_ongoing = true;

        ret_code = NRF_SUCCESS;
    }
    return ret_code;
}

/**
 * @brief   Read BNO055 register
 * 
 * @details After the read is complete, the callback is called in main context using nrf_evt_queue.
 * 
 * @retval  NRF_SUCCESS    Successfully started read
 * @retval  NRF_ERROR_BUSY There is a read/write operation already ongoing
 */
static uint32_t register_write(bno055_reg_addr_t reg_address, uint8_t value)
{
    uint32_t ret_code;
    if (register_operation_ongoing || b_on_write_idle_time)
    {
        ret_code = NRF_ERROR_BUSY;
    }
    else
    {
        register_last_op.type = REGISTER_OPERATION_TYPE_WRITE;
        register_last_op.address = reg_address;
        register_last_op.data.write = value;

        /* Writing is a single operation (no repeated start) */
        /* Refer to the BNO055 datasheet */
        nrf_drv_twi_xfer_desc_t xfer_desc = {
            .type = NRF_DRV_TWI_XFER_TX,
            .address = BNO055_ADDRESS_1,
            .primary_length = 2,
            .secondary_length = 0,
            .p_primary_buf = register_tx_buffer,
            .p_secondary_buf = NULL
        };

        register_tx_buffer[0] = reg_address;
        register_tx_buffer[1] = value;
        
        uint32_t err_code;
        err_code = nrf_drv_twi_xfer(&twi_instance, &xfer_desc, 0);
        APP_ERROR_CHECK(err_code);
        err_code = app_timer_start(register_timeout_timer, APP_TIMER_TICKS(BNO055_TWI_TIMEOUT_TIME_MS,
            APP_TIMER_PRESCALER), NULL);
        APP_ERROR_CHECK(err_code);

        register_operation_ongoing = true;

        ret_code = NRF_SUCCESS;
    }
    return ret_code;
}

/*********************************/
/** BNO055 remote state tracking */
/*********************************/

static bno055_driver_status_t remote_state_status = BNO055_DRIVER_STATUS_ASLEEP;

static bno055_page_t remote_state_page = BNO055_PAGE_INVALID;
static bool b_chip_id_verified = false;

APP_TIMER_DEF(remote_state_transition_timer);
static nrf_evt_queue_evt_t remote_state_transition_evt;
static bool b_remote_state_awaiting_transition = false;

/** @brief The actual current power mode actually set on the BNO055 */
static bno055_power_mode_t current_power_mode;
/** @brief Whether the current power mode is known and the corresponding variable is valid */
static bool b_current_power_mode_valid = false;
/** @brief The actual operating mode currently set on the BNO055 */
static bno055_operating_mode_t current_operating_mode;
/** @brief Whether the current operating mode is known and the corresponding variable is valid */
static bool b_current_operating_mode_valid = false;

/** @brief The desired power mode */
static bno055_power_mode_t target_power_mode = BNO055_POWER_MODE_SUSPEND; 
/** @brief The desired operating mode */
static bno055_operating_mode_t target_operating_mode = BNO055_OPERATING_MODE_CONFIGMODE;

bno055_driver_status_t bno055_get_driver_status(void)
{
    return remote_state_status;
}

static bool remote_state_is_ready(void)
{
    return  BNO055_DRIVER_STATUS_AWAKE == remote_state_status
            && !(register_operation_ongoing && alters_state(&register_last_op))
            && !b_remote_state_awaiting_transition
            && b_chip_id_verified
            && BNO055_PAGE_0 == remote_state_page
            && b_current_operating_mode_valid
            && b_current_power_mode_valid
            && current_operating_mode == target_operating_mode
            &&     current_power_mode == target_power_mode;
}

/**
 * @brief Update the power and operating mode to try reaching configured target state.
 * 
 * Should only be called once the state of the IMU.
 */
static void remote_state_update_modes(void)
{
    if (BNO055_OPERATING_MODE_CONFIGMODE == current_operating_mode
        && target_power_mode != current_power_mode)
    {
        (void) register_write(BNO055_REG_ADDR_PWR_MODE, target_power_mode);
    }
    else if (BNO055_POWER_MODE_NORMAL == current_power_mode
        && target_operating_mode != current_operating_mode)
    {
        (void) register_write(BNO055_REG_ADDR_OPR_MODE, target_operating_mode);
    }
    else
    {
        ASSERT(target_power_mode == current_power_mode);
        ASSERT(target_operating_mode == current_operating_mode);
        /* Do nothing */
    }
}

/** @brief Perform next necessary action to reach the target state. */
static void remote_state_update(void)
{
    if (BNO055_DRIVER_STATUS_AWAKE == remote_state_status
        && !b_remote_state_awaiting_transition) switch (remote_state_page)
    {
        case BNO055_PAGE_INVALID:
        {
            (void) register_read(BNO055_REG_ADDR_PAGE_ID, 1);
        } break;
        case BNO055_PAGE_1:
        {
            (void) register_write(BNO055_REG_ADDR_PAGE_ID, BNO055_PAGE_0);
        } break;
        case BNO055_PAGE_0:
            if (!b_chip_id_verified)
            {
                (void) register_read(BNO055_REG_ADDR_CHIP_ID, 1);
            }
            else if (!b_current_operating_mode_valid)
            {
                (void) register_read(BNO055_REG_ADDR_OPR_MODE, 1);
            }
            else if (!b_current_power_mode_valid)
            {
                (void) register_read(BNO055_REG_ADDR_PWR_MODE, 1);
            }
            else /* We have all information on remote states */
            {
                remote_state_update_modes();
            }
        break;
        default:
            ASSERT(false);
        break; 
    }
}

static void remote_state_transition_done(void)
{
    ASSERT(b_remote_state_awaiting_transition);
    b_remote_state_awaiting_transition = false;
    if (remote_state_is_ready())
    {
        bno055_evt_t evt;
        evt.type = BNO055_EVT_TYPE_READY;
        evt.data.ready = BNO055_READY_EVT_TYPE_STATE_REACHED;
        bno055_evt_callback(&evt);
    }
    else
    {
        remote_state_update();
    }
}

static void remote_state_transition_timer_handler(void * p_context)
{
    uint32_t err_code = nrf_evt_queue_put(&remote_state_transition_evt, remote_state_transition_done);
    APP_ERROR_CHECK(err_code);
}

static void remote_state_on_register_read_success(uint8_t address, uint8_t value)
{
    /* Whether the read value is consistent with out tracked state */
    bool b_is_inconsistent = false;

    /* TODO: Check that page IDs and power modes are valid values */
    if (BNO055_REG_ADDR_PAGE_ID == address)
    {
        if (BNO055_PAGE_INVALID != remote_state_page && value != remote_state_page) b_is_inconsistent = true;
        else remote_state_page = value;
    }
    else if (0x00 == remote_state_page) switch (address)
    {
        case BNO055_REG_ADDR_OPR_MODE:
            if (b_current_operating_mode_valid && value != current_operating_mode) b_is_inconsistent = true;
            else
            {
                b_current_operating_mode_valid = true;
                current_operating_mode = value;
            }
        break;
        case BNO055_REG_ADDR_PWR_MODE:
            if (b_current_power_mode_valid && value != current_power_mode) b_is_inconsistent = true;
            else
            {
                b_current_power_mode_valid = true;
                current_power_mode = value;
            }
        break;
        case BNO055_REG_ADDR_CHIP_ID:
            if (value != BNO055_CHIP_ID) b_is_inconsistent = true;
            else b_chip_id_verified = true;
        break;
        default:
            /* Register is not relevant to remote state tracking */
        break;
    }

    /* If we are supposed to know a given value, and it turns out to be wrong, we panic into
     * an unrecoverable failure.
     * A possible cause for this might be a reset of the BNO055 */
   if (b_is_inconsistent)
   {
        nrf_drv_twi_disable(&twi_instance);
        on_failure(BNO055_FAILURE_REASON_INCONSISTENCY);
   }
}

