cbernett/pipas/nrf/nRF5_SDK_11.0.0_89a8197/applications/code/pipas/include/nrf_bno055.c
static void remote_state_on_write_success(uint8_t address, uint8_t value)
{
    ASSERT(!b_remote_state_awaiting_transition);

    uint32_t transition_time_ms = 0;
    if (BNO055_REG_ADDR_PAGE_ID == address)
    {
        remote_state_page = value;
    }
    else if (0x00 == remote_state_page) switch (address)
    {
        /* TODO: Check that the value variable is a valid value for the enums */
        case BNO055_REG_ADDR_OPR_MODE:
        {
            bno055_operating_mode_t new_operating_mode = value;
            transition_time_ms = get_operating_mode_transition_time_ms(current_operating_mode,
                new_operating_mode);
            current_operating_mode = new_operating_mode;
        } break;
        case BNO055_REG_ADDR_PWR_MODE:
        {
            bno055_power_mode_t new_power_mode = value;
            transition_time_ms = get_power_mode_transition_time_ms(current_power_mode, new_power_mode);
            current_power_mode = value;
        } break;
        default:
            /* The message isn't relevant to remote state tracking */
        break;
    }

    if (0 < transition_time_ms)
    {
        b_remote_state_awaiting_transition = true;
        uint32_t err_code = app_timer_start(remote_state_transition_timer,
            APP_TIMER_TICKS(transition_time_ms, APP_TIMER_PRESCALER), NULL);
        APP_ERROR_CHECK(err_code);
    }
}

/**
 * @brief Callback for *any* TWI operation.
 * 
 * Called after any TWI operation successfully completes, even those that were not started by
 * remote_state.
 */
static void remote_state_on_operation_success(const register_operation_t * p_op)
{
    ASSERT(BNO055_DRIVER_STATUS_AWAKE == remote_state_status);
    switch (p_op->type)
    {
        case REGISTER_OPERATION_TYPE_WRITE: /* Register write */
            remote_state_on_write_success(p_op->address, p_op->data.write);
        break;
        case REGISTER_OPERATION_TYPE_READ: /* Register read */
            /* Remember that contiguous registers may be read in a single read operation */
            for (int reg_index = 0; reg_index < p_op->data.read.rx_len; ++reg_index)
            {
                remote_state_on_register_read_success(p_op->address + reg_index,
                    p_op->data.read.p_rx_buf[reg_index]);
            }
        break;
        default:
            ASSERT(false);
        break;
    }

    remote_state_update();
}

uint32_t bno055_wakeup(void)
{
    uint32_t ret;
    switch (remote_state_status)
    {
        case BNO055_DRIVER_STATUS_ASLEEP:
            remote_state_page = BNO055_PAGE_INVALID;
            b_chip_id_verified = false;
            b_current_operating_mode_valid = false;
            b_current_power_mode_valid = false;

            remote_state_status = BNO055_DRIVER_STATUS_AWAKE;

            nrf_drv_twi_enable(&twi_instance);
            remote_state_update();
            ret = NRF_SUCCESS;
        break;
        case BNO055_DRIVER_STATUS_AWAKE:
            ret = NRF_ERROR_INVALID_STATE;
        break;
        default:
            ASSERT(false);
        break;
    }
    return ret;
}

/*********************/
/* Direct operations */
/*********************/

typedef enum {
    SIMPLE_OPERATION_STATE_ONGOING,
    SIMPLE_OPERATION_STATE_CANCELLED,
    SIMPLE_OPERATION_STATE_INACTIVE
} simple_operation_state_t;

static simple_operation_state_t simple_operation_state = SIMPLE_OPERATION_STATE_INACTIVE;
static void (*simple_operation_complete_callback)(const register_operation_t *);

/* @brief Callback for when quat_read operation has completed. */
static void simple_quat_read_complete(const register_operation_t * p_op)
{
    ASSERT(REGISTER_OPERATION_TYPE_READ == p_op->type);
    ASSERT(8 == p_op->data.read.rx_len);
    ASSERT(NULL != p_op->data.read.p_rx_buf);

    bno055_evt_t evt;
    evt.type = BNO055_EVT_TYPE_QUAT_READ_DONE;
    /* The expression *(int8_t) &val is a way to convert uint8_t to int8_t that does not
     * invoke undefined behavior, because uint8_t and int8_t, unlike other types such
     * char and int, are guaranteed to use 2's complement representation. */
    evt.data.quat_read_done.w = 256 * *(int8_t *) &register_rx_buffer[1] + register_rx_buffer[0];
    evt.data.quat_read_done.x = 256 * *(int8_t *) &register_rx_buffer[3] + register_rx_buffer[2];
    evt.data.quat_read_done.y = 256 * *(int8_t *) &register_rx_buffer[5] + register_rx_buffer[4];
    evt.data.quat_read_done.z = 256 * *(int8_t *) &register_rx_buffer[7] + register_rx_buffer[6];
    bno055_evt_callback(&evt);
}

uint32_t bno055_read_quat(void)
{
    uint32_t ret_code;
    if (remote_state_is_ready() && is_fusion_mode(target_operating_mode))
    {
        ret_code = register_read(BNO055_REG_ADDR_QUA_DATA_W_LSB, 8);
    }
    else
    {
        ret_code = NRF_ERROR_INVALID_STATE;
    }

    if (NRF_SUCCESS == ret_code)
    {
        simple_operation_complete_callback = simple_quat_read_complete;
        simple_operation_state = SIMPLE_OPERATION_STATE_ONGOING;
    }

    return ret_code;
}

static void simple_register_read_complete(const register_operation_t * p_op)
{
    bno055_evt_t evt;
    evt.type = BNO055_EVT_TYPE_REGISTER_READ_DONE;
    evt.data.register_read_done.p_data = p_op->data.read.p_rx_buf;
    evt.data.register_read_done.data_size = p_op->data.read.rx_len;
    bno055_evt_callback(&evt);
}

uint32_t bno055_read_register(bno055_reg_addr_t addr, uint8_t length)
{
    uint32_t ret_code;

    if (remote_state_is_ready() && BNO055_POWER_MODE_SUSPEND != target_power_mode)
    {
        ret_code = register_read(addr, length);
    }
    else
    {
        ret_code = NRF_ERROR_INVALID_STATE;
    }

    if (NRF_SUCCESS == ret_code)
    {
        simple_operation_complete_callback = simple_register_read_complete;
        simple_operation_state = SIMPLE_OPERATION_STATE_ONGOING;
    }
    return ret_code;
}

static void simple_on_operation_success(const register_operation_t * p_op)
{
    switch (simple_operation_state)
    {
        case SIMPLE_OPERATION_STATE_ONGOING:
            simple_operation_state = SIMPLE_OPERATION_STATE_INACTIVE;
            ASSERT(NULL != simple_operation_complete_callback);
            simple_operation_complete_callback(p_op);
        break;
        case SIMPLE_OPERATION_STATE_CANCELLED:
            simple_operation_state = SIMPLE_OPERATION_STATE_INACTIVE;
        break;
        case SIMPLE_OPERATION_STATE_INACTIVE:
            /* Not the result of a simple operation */
        break;
        default:
            ASSERT(false);
        break;
    }
}

uint32_t bno055_cancel_read(void)
{
    uint32_t ret_code = NRF_ERROR_INVALID_STATE;
    if (SIMPLE_OPERATION_STATE_ONGOING == simple_operation_state)
    {
        simple_operation_state = SIMPLE_OPERATION_STATE_CANCELLED;
        ret_code = NRF_SUCCESS;
    }
    return ret_code;
}

/**********/
/* Common */
/**********/

static void on_register_operation_success(const register_operation_t * p_op)
{
    bool b_was_a_cancelled_op = SIMPLE_OPERATION_STATE_CANCELLED == simple_operation_state;
    bool b_was_ready = remote_state_is_ready() && !alters_state(p_op);

    /* Remote state needs to be updated *before* any callbacks are called through
     * simple_on_operation_success */
    remote_state_on_operation_success(p_op);

    /* Only report simple operation successes if remote state was "ready" *before* the operation in
     * question (i.e. we need to check for readiness before updating the state) */
    if (b_was_ready) simple_on_operation_success(p_op);
    /* If the simple operation itself broke the ready state, we want to make sure that we are
     * not left expecting the completion for that operation. */
    else simple_operation_state = SIMPLE_OPERATION_STATE_INACTIVE;

    /* If the operation was both manual and a valid remote state operation, the ready event type
     * STATE_REACHED takes precedence (even though manual operations might break the readiness of
     * remote state, they may not if they wrote the same mode that was configured or it was
     * followed by a call to remote_state). */

    /* Report ready event if we were not ready before, but are ready now */
    if (!b_was_ready && remote_state_is_ready())
    {
        bno055_evt_t evt;
        evt.type = BNO055_EVT_TYPE_READY;
        evt.data.ready = BNO055_READY_EVT_TYPE_STATE_REACHED;
        bno055_evt_callback(&evt);
    }
    else if (b_was_a_cancelled_op)
    {
        bno055_evt_t evt;
        evt.type = BNO055_EVT_TYPE_READY;
        evt.data.ready = BNO055_READY_EVT_TYPE_CANCELLED;
        bno055_evt_callback(&evt);
    }
}

static void on_failure(bno055_failure_reason_t reason)
{
    failure_reason = reason;

    simple_operation_state = SIMPLE_OPERATION_STATE_INACTIVE;

    remote_state_page = BNO055_PAGE_INVALID;
    b_chip_id_verified = false;
    b_current_operating_mode_valid = false;
    b_current_power_mode_valid = false;

