cbernett/pipas/nrf/nRF5_SDK_11.0.0_89a8197/applications/code/pipas/include/nrf_bno055.c
    remote_state_status = BNO055_DRIVER_STATUS_ASLEEP;

    bno055_evt_t evt;
    evt.type = BNO055_EVT_TYPE_FAILURE;
    bno055_evt_callback(&evt);
}

bno055_failure_reason_t bno055_get_failure_reason(void)
{
    return failure_reason;
}

bool bno055_is_ready(void)
{
    return remote_state_is_ready() && SIMPLE_OPERATION_STATE_CANCELLED != simple_operation_state;
}

bno055_power_mode_t bno055_get_power_mode(void)
{
    return target_power_mode;
}

bno055_operating_mode_t bno055_get_operating_mode(void)
{
    return target_operating_mode;
}

uint32_t bno055_set_power_mode(bno055_power_mode_t power_mode)
{
    uint32_t ret_code;
    if (SIMPLE_OPERATION_STATE_ONGOING == simple_operation_state)
    {
        ret_code = NRF_ERROR_BUSY;
    }
    /* Power mode changes are only allowed in when there's no failure, in CONFIG operating mode. */
    else if (target_power_mode != power_mode
           && BNO055_OPERATING_MODE_CONFIGMODE == target_operating_mode)
    {
        target_power_mode = power_mode;
        remote_state_update();
        ret_code = NRF_SUCCESS;
    }
    else
    {
        ret_code = NRF_ERROR_INVALID_STATE;
    }
    return ret_code;
}

uint32_t bno055_set_operating_mode(bno055_operating_mode_t operating_mode)
{
    uint32_t ret_code;
    if (SIMPLE_OPERATION_STATE_ONGOING == simple_operation_state)
    {
        ret_code = NRF_ERROR_BUSY;
    }
    else if (target_operating_mode != operating_mode
           && BNO055_POWER_MODE_NORMAL == target_power_mode)
    {
        target_operating_mode = operating_mode;
        remote_state_update();
        ret_code = NRF_SUCCESS;
    }
    else
    {
        ret_code = NRF_ERROR_INVALID_STATE;
    }
    return ret_code;
}

uint32_t bno055_set_operating_and_power_modes(bno055_operating_mode_t operating_mode, bno055_power_mode_t power_mode)
{
    uint32_t ret_code;
    if (SIMPLE_OPERATION_STATE_ONGOING == simple_operation_state)
    {
        ret_code = NRF_ERROR_BUSY;
    }
    else if (target_operating_mode == operating_mode && target_power_mode == power_mode)
    {
        ret_code = NRF_ERROR_INVALID_STATE;
    }
    else if (BNO055_OPERATING_MODE_CONFIGMODE != operating_mode && BNO055_POWER_MODE_NORMAL != power_mode)
    {
        ret_code = NRF_ERROR_INVALID_PARAM;
    }
    else
    {
        target_operating_mode = operating_mode;
        target_power_mode = power_mode;
        remote_state_update();
        ret_code = NRF_SUCCESS;
    }
    return ret_code;
}

void bno055_init(nrf_drv_twi_config_t * p_config, void (* evt_callback)(bno055_evt_t *))
{
    ASSERT(NULL != evt_callback);
    bno055_evt_callback = evt_callback;
    uint32_t err_code;
    err_code = nrf_drv_twi_init(&twi_instance, p_config, register_twi_handler, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&register_timeout_timer, APP_TIMER_MODE_SINGLE_SHOT, register_timeout_handler);
    APP_ERROR_CHECK(err_code);
    err_code = app_timer_create(&remote_state_transition_timer, APP_TIMER_MODE_SINGLE_SHOT,
        remote_state_transition_timer_handler);
    APP_ERROR_CHECK(err_code);
    err_code = app_timer_create(&write_idle_time_done_timer, APP_TIMER_MODE_SINGLE_SHOT, write_idle_time_done_handler);
    APP_ERROR_CHECK(err_code);
}